---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Plumbing.Pipe
zh: 管道、水管、管线
source: html/5882a277-cba2-cefa-f5fb-2f43f247b4dc.htm
---
# Pipe Members

**中文**: 管道、水管、管线

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.